# NoAvailableMatchingConnector Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..NoAvailableMatchingConnector Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot add [Element] to Circuit. There is no available connector matching the Type ([Type Name]) for the Circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoAvailableMatchingConnector { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoAvailableMatchingConnector As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoAvailableMatchingConnector {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace